Tekla Open API Reference for Tekla Structures 2025
ConnectiveGeometryException Constructor (BentPlateGeometrySolver.OperationStatus, String)
 Initializes a new instance of the ConnectiveGeometryException class with connective geometry error message based on status.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ConnectiveGeometryException(
	BentPlateGeometrySolver.OperationStatus status,
	string errorMessage
)
Public Sub New (
	status As BentPlateGeometrySolver.OperationStatus,
	errorMessage As String
)
Parameters
status
Type: Tekla.Structures.Model.BentPlateGeometrySolver.OperationStatus
Possible error statuses for geometry creation/modification commands.
errorMessage
Type: System.String
The message that describes the error status.
See Also
Reference
ConnectiveGeometryException Class
ConnectiveGeometryException Overload
Tekla.Structures.Model Namespace